/*Assigment 1 
Також свторіть 2 змінні і самостійно виведіЗробіть розрахунки і виведіть в консоль ось такі математичні операції
;*/

let result1 = (5 + 3) * 2 - 7;
console.log(5 + 3 * 2 - 7);
let result2 = (10 / 2) ** 2;
console.log(10 / 2) ** 2);
let result3 = 2 * (4 + 3) - (8 / 2);
console.log(2 * (4 + 3) - (8 / 2));
let result4 = (15 % 4) + 5;
console.log((15 % 4) + 5);
let result5 = 3 - (2 ** 4);
console.log(3 - (2 ** 4);

/*Assigment 2 
1.Логічні порівняння та alert:

Створіть змінні number1 та number2 і використайте оператори порівняння, щоб визначити, чи вони рівні.
Виведіть результат за допомогою alert, щоб повідомити користувача про те, чи рівні числа.*/

let firstnumber = 5;
let secondnumber = 7;

console.log + operation: $(firstnumber)


2.Метод вводу інформації та логічні порівняння:

Використовуючи prompt, запросіть у користувача введення числа.
Перевірте, чи введене число парне чи непарне.
Виведіть результат з використанням console.log.

3. логічні порівняння та введення-виведення:

Використовуючи prompt, запитайте у користувача його вік.
Перевірте, чи вік менше 18 років.
Виведіть відповідне повідомлення про те, чи може користувач використовувати певний ресурс.

4. Розрахунок вартості товару та console.log:

Створіть змінну ціна та кількість товару і присвойте їм значення використовуючи prompt .
Використовуйте математичні операції для обчислення вартості товару (ціна * кількість).
Виведіть результат за допомогою console.log.

5. Розрахунок знижки на товар та alert:

Використовуючи prompt, запросіть в користувача вартість товару.
Розрахуйте знижку на товар у розмірі 50% від введеної вартості.
Виведіть результат знижки за допомогою alert.


